In [ ]:
import json

# 예시: Member 클래스 정의
class Member:
    def __init__(self, name, age, email):
        self.name = name
        self.age = age
        self.email = email

    def __repr__(self):
        return f"Member(name={self.name}, age={self.age}, email={self.email})"

# dict -> Member 객체 변환 함수
def as_member(d):
    return Member(d['name'], d['age'], d['email'])

In [2]:
import pandas as pd

arr = pd.array([1,2,3,4])
arra10 = arr*10

print(arra10)

<IntegerArray>
[10, 20, 30, 40]
Length: 4, dtype: Int64

In [3]:
import pandas as pd

csv = pd.read_csv("data/ch09_customers.txt")
s = pd.Series({"a" : 1, "b" : 2, "c" : 3})
print(s)

a    1
b    2
c    3
dtype: int64

In [4]:
import pandas as pd
s = pd.Series({"a" : 1, "b" : 2, "c" : 3})
print(s)

a    1
b    2
c    3
dtype: int64

In [5]:
import pandas as pd
data = {
    "이름": ["김철수", "이영희", "박민수"],
    "나이": [25, 32, 19],
    "도시": ["서울", "부산", "대구"]
}
df = pd.DataFrame(data)
print(df)
print("데이터프레임의 차원:", df.shape)

    이름  나이  도시
0  김철수  25  서울
1  이영희  32  부산
2  박민수  19  대구
데이터프레임의 차원: (3, 3)

In [6]:
print(df.columns)

Index(['이름', '나이', '도시'], dtype='object')

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      3 non-null      object
 1   나이      3 non-null      int64
 2   도시      3 non-null      object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

In [8]:
df.describe()

              나이
count   3.000000
mean   25.333333
std     6.506407
min    19.000000
25%    22.000000
50%    25.000000
75%    28.500000
max    32.000000

In [9]:
column_data = df['도시']
column_data

0    서울
1    부산
2    대구
Name: 도시, dtype: object

In [10]:
selected_columns = df[['도시', '이름']]
selected_columns

   도시   이름
0  서울  김철수
1  부산  이영희
2  대구  박민수

In [11]:
df.head(1)

    이름  나이  도시
0  김철수  25  서울

In [12]:
df.tail(1)

    이름  나이  도시
2  박민수  19  대구

In [14]:
with pd.option_context('display.max_rows', 2, 'display.max_columns', 2):
    pd.set_option("show_dimensions", False)
    display(df)

     이름  ...  도시
0   김철수  ...  서울
..  ...  ...  ..
2   박민수  ...  대구

In [15]:
row = df.loc[0]
print(row)

이름    김철수
나이     25
도시     서울
Name: 0, dtype: object

In [16]:
# 리스트로 여러 행(첫번째 행 '0'과 세번째 행 '2') 선택
selected_rows1 = df.loc[[0, 2]]
selected_rows1

    이름  나이  도시
0  김철수  25  서울
2  박민수  19  대구

In [17]:
# df의 모든 행에 대한 "도시" 열 데이터 선택
selected_column = df.loc[:, '도시']
selected_column

0    서울
1    부산
2    대구
Name: 도시, dtype: object

In [18]:
# df에서 '도시'과 '이름' 열을 선택
selected_columns1 = df.loc[:, ['도시', '이름']]
print(selected_columns1)

   도시   이름
0  서울  김철수
1  부산  이영희
2  대구  박민수

In [19]:
# df에서 '나이'부터 '도시' 열까지 선택
selected_columns2 = df.loc[:, '나이':'도시']
print(selected_columns2)

   나이  도시
0  25  서울
1  32  부산
2  19  대구

In [20]:
# '이름' 열의 첫번째 행 '0'
selected_value = df.loc[0, '이름']
selected_value

'김철수'

In [21]:
# '이름'과 '나이' 열의 두번째 행부터 세번째 행까지 데이터 선택
selected_values = df.loc[1:2, ['이름', '나이']]
selected_values

    이름  나이
1  이영희  32
2  박민수  19

In [22]:
# 첫번째 행 선택
row = df.iloc[0]

# 두번째 열 선택
column = df.iloc[:, 1]

print(row)
print('------------------------')
print(column)

이름    김철수
나이     25
도시     서울
Name: 0, dtype: object
------------------------
0    25
1    32
2    19
Name: 나이, dtype: int64

In [23]:
# 첫번째부터 두번째(세번째 행은 포함되지 않음) 행 선택
rows_iloc = df.iloc[0:2]

# 두번째(세번째 열은 포함되지 않음) 열 선택
columns_iloc = df.iloc[:, 1:2]

print(rows_iloc)
print('------------------------')
print(columns_iloc)

    이름  나이  도시
0  김철수  25  서울
1  이영희  32  부산
------------------------
   나이
0  25
1  32
2  19

In [25]:
# 첫번째부터 두번째(세번째는 포함되지 않음) 행 선택
rows_loc = df.loc[0:2]

# 두번째부터 세번째 열 선택
columns_loc = df.loc[:, '나이':'도시']

print(rows_loc)
print('------------------------')
print(columns_loc)

    이름  나이  도시
0  김철수  25  서울
1  이영희  32  부산
2  박민수  19  대구
------------------------
   나이  도시
0  25  서울
1  32  부산
2  19  대구

In [26]:
# 첫번째, 세번째 행 선택
rows_list = df.iloc[[0, 2]]

# 첫번째, 세번째 열 선택
columns_list = df.iloc[:, [0, 2]]

print(rows_list)
print('------------------------')
print(columns_list)

    이름  나이  도시
0  김철수  25  서울
2  박민수  19  대구
------------------------
    이름  도시
0  김철수  서울
1  이영희  부산
2  박민수  대구